---
layout:     post   				    # 使用的布局（不需要改）
title:      Markdown训练使用复盘笔记 				# 标题
subtitle:   how to use Markdown #副标题
date:       2018-04-19 				# 时间
author:     Molly 						# 作者
header-img: img/fupanbiji.jpg 	#这篇文章标题背景图片
catalog: true 						# 是否归档
tags:								#标签
    - Note:markdown
---


# Markdown编辑器使用复盘

## 2018-4-19

  ### 1、复盘出现的问题

  我没有使用过Markdown的功能，也没有任何Markdown语法使用基础。
  上次把我的blog部署好以后，我就没有学习过或者主动训练过这个语法的使用规则了。
  昨天一口气写了好几篇文章，上传了一篇我觉得比较重要且独立成主题的文章。
  但是我发表了以后发现排版简直不忍直视。这里复盘一下出现的问题以及训练的计划、思考。

  我把文章默认的格式设置重新做了一遍以后，发现还是没有呈现应该有的样子。
  这里就出现了第一个问题：**保存为md格式的文档** →「在电脑编辑器端口或者提交到github上面，
  都要记得修改这个」。

  第二个问题，#符号是用来标注标题的，有几个符号，就是几级标题。但是我使用之后，发现一个问题
  → **#符号以后要跟一个空格才有效**

  第三个问题，**要空一行才能换行**。

  ### 训练计划
  在这个网址上有practice的游戏。[markdown在线训练](https://www.markdowntutorial.com/)
  我昨天使用了一下，发现如果跟着游戏训练能够得到初步的印象，但是一些细节的地方以及熟练程度
  仍然需要提高。所以，我觉得可以训练这个游戏，但我自己写作之后进行排版就可以具体问题具体google，然后再写下复盘出现的问题就可以了。等将来有必要，可以专门抽出一天的时间，看看别人的Markdown排版高阶用法，让我的排版变得更好看。

  > 总结一下：
    1、游戏网站刻意训练，得到初步印象；
    2、使用过程之中，发现问题、解决问题、记录问题；
    3、在有必要的前提下，单爆学习高阶排版使用方法。
